Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_WPS/cy_wps_common.c
/*
 * Copyright 2023, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/**
* @file cy_wps_common.c
* @brief WPS common file for handling M1 to M8 WPS messages
*/


#include "cy_wps_common.h"

#include <stdint.h>
#include <string.h>

#include "cy_template_wps_packets.h"
#include "cy_wps_constants.h"
#include "cy_wps_structures.h"
#include "cy_wcm_log.h"
#include "cy_wps_crypto.h"
#include "nn.h"
#include "whd_int.h"
#include "whd_buffer_api.h"
#include "whd_types.h"
#include "cyhal.h"

/******************************************************
 *                      Macros
 ******************************************************/

#define wps_assert(x, y)
#define WPS_DH_GENERATE_KEY(a, b)    DH_generate_key(a, b)

/* Returns the opposite agent type (enrollee changes to registrar. registrar changes to enrollee) */
#define OPPOSITE_AGENT_TYPE(type)    (( workspace->agent_type + 1 ) & 1)

/******************************************************
 *                    Constants
 ******************************************************/
#define AES_BLOCK_SZ                         16
#define ETHER_TYPE_802_1X                    0x888e              /* 802.1x */

#define MAX_PERSONALIZATION_STRING_SIZE      64 /* This may need to be modified */

#define PRIVATE_KEY_NN_LENGTH        (12)       /* 12 x 32 bits = 384 bit private key */
#define PRIVATE_KEY_BYTE_LENGTH      (PRIVATE_KEY_NN_LENGTH * 4)

#define WPS_ENCRYPTION_BLOCK_SIZE    (16)
#define WPS_AUTHENTICATOR_LEN        (8)

#define WPS_LENGTH_FIELD_MASK        (0x02)
#define WPS_MORE_FRAGMENTS_MASK      (0x01)
#define WPS_MESSAGE_TYPE_M1          (0x04)
#ifndef TRUE
#define TRUE   (1)
#endif /* ifndef TRUE */

#ifndef FALSE
#define FALSE  (0)
#endif /* ifndef FALSE */

#ifdef ENABLE_WCM_LOGS
#define cy_wcm_log_msg cy_log_msg
#else
#define cy_wcm_log_msg(a,b,c,...)
#endif

static const uint8_t DH_P_VALUE[SIZE_1536_BITS] =
{
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
    0xC9, 0x0F, 0xDA, 0xA2, 0x21, 0x68, 0xC2, 0x34,
    0xC4, 0xC6, 0x62, 0x8B, 0x80, 0xDC, 0x1C, 0xD1,
    0x29, 0x02, 0x4E, 0x08, 0x8A, 0x67, 0xCC, 0x74,
    0x02, 0x0B, 0xBE, 0xA6, 0x3B, 0x13, 0x9B, 0x22,
    0x51, 0x4A, 0x08, 0x79, 0x8E, 0x34, 0x04, 0xDD,
    0xEF, 0x95, 0x19, 0xB3, 0xCD, 0x3A, 0x43, 0x1B,
    0x30, 0x2B, 0x0A, 0x6D, 0xF2, 0x5F, 0x14, 0x37,
    0x4F, 0xE1, 0x35, 0x6D, 0x6D, 0x51, 0xC2, 0x45,
    0xE4, 0x85, 0xB5, 0x76, 0x62, 0x5E, 0x7E, 0xC6,
    0xF4, 0x4C, 0x42, 0xE9, 0xA6, 0x37, 0xED, 0x6B,
    0x0B, 0xFF, 0x5C, 0xB6, 0xF4, 0x06, 0xB7, 0xED,
    0xEE, 0x38, 0x6B, 0xFB, 0x5A, 0x89, 0x9F, 0xA5,
    0xAE, 0x9F, 0x24, 0x11, 0x7C, 0x4B, 0x1F, 0xE6,
    0x49, 0x28, 0x66, 0x51, 0xEC, 0xE4, 0x5B, 0x3D,
    0xC2, 0x00, 0x7C, 0xB8, 0xA1, 0x63, 0xBF, 0x05,
    0x98, 0xDA, 0x48, 0x36, 0x1C, 0x55, 0xD3, 0x9A,
    0x69, 0x16, 0x3F, 0xA8, 0xFD, 0x24, 0xCF, 0x5F,
    0x83, 0x65, 0x5D, 0x23, 0xDC, 0xA3, 0xAD, 0x96,
    0x1C, 0x62, 0xF3, 0x56, 0x20, 0x85, 0x52, 0xBB,
    0x9E, 0xD5, 0x29, 0x07, 0x70, 0x96, 0x96, 0x6D,
    0x67, 0x0C, 0x35, 0x4E, 0x4A, 0xBC, 0x98, 0x04,
    0xF1, 0x74, 0x6C, 0x08, 0xCA, 0x23, 0x73, 0x27,
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF
};

#define KDK_REQUIRED_CRYPTO_MATERIAL          (CY_WPS_CRYPTO_MATERIAL_ENROLLEE_NONCE | CY_WPS_CRYPTO_MATERIAL_REGISTRAR_NONCE | CY_WPS_CRYPTO_MATERIAL_ENROLLEE_MAC_ADDRESS)

/******************************************************
 *                   Enumerations
 ******************************************************/

typedef enum
{
    CY_WPS_HASH1_INDEX,
    CY_WPS_HASH2_INDEX,
    CY_WPS_SNONCE1_INDEX,
    CY_WPS_SNONCE2_INDEX,
    CY_WPS_NONCE_INDEX,
    CY_WPS_UUID_INDEX,
} cy_wps_agent_specific_tlv_index_t;

/******************************************************
 *                 Type Definitions
 ******************************************************/

/******************************************************
 *                    Structures
 ******************************************************/

/******************************************************
 *               Static Function Declarations
 ******************************************************/

/* Message content creation functions */
static uint8_t*     cy_wps_write_nonce                 ( cy_wps_agent_t* workspace, uint8_t* iter );
static uint8_t*     cy_wps_write_hashes                ( cy_wps_agent_t* workspace, uint8_t* iter );
static uint8_t*     cy_wps_write_secret1               ( cy_wps_agent_t* workspace, uint8_t* iter );
static uint8_t*     cy_wps_write_secret2               ( cy_wps_agent_t* workspace, uint8_t* iter );
static uint8_t*     cy_wps_write_credentials           ( cy_wps_agent_t* workspace, uint8_t* iter );
static uint8_t*     cy_wps_write_common_header         ( cy_wps_agent_t* workspace, uint8_t* start_of_packet, uint8_t message_type );
static uint8_t*     cy_wps_write_vendor_extension      ( uint8_t* iter, cy_wps_agent_t* workspace );
static uint8_t*     cy_wps_start_encrypted_tlv         ( uint8_t* iter);
static uint8_t*     cy_wps_end_encrypted_tlv           ( cy_wps_agent_t* workspace, uint8_t* start_of_encrypted_tlv_header, uint8_t* end_of_data );
static void         cy_wps_send_protocol_message       ( cy_wps_agent_t* workspace, cy_packet_t* packet, uint8_t* start_of_packet, uint8_t* iter );
static void         cy_wps_encrypt_data                ( uint8_t* input, uint16_t input_length, cy_key_wrap_key_t* encr_key, uint8_t* output, cy_wps_iv_t* iv );
static cy_rslt_t    cy_wps_send_wsc_nack               ( cy_wps_agent_t* workspace, uint16_t config_error);
static cy_rslt_t    cy_wps_send_done                   ( cy_wps_agent_t* workspace );

/* Message processing functions */
static cy_rslt_t    cy_wps_process_message_content     ( cy_wps_agent_t* workspace, uint8_t* content, uint16_t content_length, uint32_t tlv_mask );
static cy_rslt_t    cy_wps_process_encrypted_tlvs      ( cy_wps_agent_t* workspace, cy_wps_encryption_data_t* encrypted_data, uint16_t encrypted_data_length, uint32_t valid_tlv_mask );
static cy_rslt_t    cy_wps_process_credential          ( cy_wps_agent_t* workspace, uint8_t* data, uint16_t data_length );
static int          cy_wps_decrypt_data                ( cy_wps_encryption_data_t* encrypted_data, uint16_t encrypted_data_length, cy_key_wrap_key_t* encr_key, uint8_t* plain_text);
static cy_rslt_t    cy_wps_validate_secret_nonce       ( cy_wps_agent_t* workspace, cy_wps_agent_data_t* agent_data, uint8_t* data, uint8_t which_nonce);
static uint8_t*     cy_get_wps_packet_data             ( cy_wps_msg_packet_t* packet);

