Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_WPS/cy_wps_common.c
/* Packet fragmentation functions */
static cy_rslt_t    cy_wps_process_packet_fragmentation(cy_wps_agent_t* workspace, cy_packet_t eapol_packet, uint8_t** data, uint16_t* data_size );
static void         cy_wps_free_unfragmented_packet    ( cy_wps_agent_t* workspace );
static void         cy_wps_init_unfragmented_packet    ( cy_wps_agent_t* workspace, uint16_t total_length );
static void         cy_wps_append_fragment             ( cy_wps_agent_t* workspace, void* fragment, uint16_t fragment_length );
static void         cy_wps_retrieve_unfragmented_packet( cy_wps_agent_t* workspace, cy_packet_t* packet, uint16_t* packet_length );
static uint32_t     cy_wps_send_frag_ack               ( cy_wps_agent_t* workspace );

/* Event handling functions */
static cy_rslt_t    cy_wps_common_event_handler        (cy_wps_agent_t* workspace, cy_event_message_t* message);

/* Calculation functions */
static cy_rslt_t    cy_wps_calculate_kdk               ( cy_wps_agent_t* workspace );
static cy_rslt_t    cy_wps_calculate_kdf               ( uint8_t* key, uint16_t key_length, char* personalization_string, uint8_t* output, uint16_t output_length );
static cy_rslt_t    cy_wps_calculate_hash              ( cy_wps_agent_t* workspace, cy_wps_agent_data_t* source, cy_wps_hash_t* output, uint8_t hash );
static cy_rslt_t    cy_wps_calculate_psk               ( cy_wps_agent_t* workspace );

static void         cy_wps_cleanup_workspace           ( cy_wps_agent_t* workspace );

#ifdef COMPONENT_4390X
extern cy_rslt_t cy_prng_get_random( void* buffer, uint32_t buffer_length );
#endif
/******************************************************
 *               Variable Definitions
 ******************************************************/

static uint32_t DH_G_VALUE = 2;

static const uint16_t agent_specific_tlv_id[2][6] =
{
    [CY_WPS_ENROLLEE_AGENT] =
    {
        [CY_WPS_HASH1_INDEX]   = WPS_ID_E_HASH1,
        [CY_WPS_HASH2_INDEX]   = WPS_ID_E_HASH2,
        [CY_WPS_SNONCE1_INDEX] = WPS_ID_E_SNONCE1,
        [CY_WPS_SNONCE2_INDEX] = WPS_ID_E_SNONCE2,
        [CY_WPS_NONCE_INDEX]   = WPS_ID_ENROLLEE_NONCE,
        [CY_WPS_UUID_INDEX]    = WPS_ID_UUID_E,
    },
    [CY_WPS_REGISTRAR_AGENT] =
    {
        [CY_WPS_HASH1_INDEX]   = WPS_ID_R_HASH1,
        [CY_WPS_HASH2_INDEX]   = WPS_ID_R_HASH2,
        [CY_WPS_SNONCE1_INDEX] = WPS_ID_R_SNONCE1,
        [CY_WPS_SNONCE2_INDEX] = WPS_ID_R_SNONCE2,
        [CY_WPS_NONCE_INDEX]   = WPS_ID_REGISTRAR_NONCE,
        [CY_WPS_UUID_INDEX]    = WPS_ID_UUID_R,
    }
};

const cy_wps_state_machine_state_t wps_states[2][4] =
{
    [CY_WPS_ENROLLEE_AGENT] =
    {
        // Sending M1, Receiving M2
        [CY_WPS_SENDING_PUBLIC_KEYS] =
        {
            .valid_message_type    = WPS_ID_MESSAGE_M2,
            .outgoing_message_type = WPS_ID_MESSAGE_M1,
            .tlv_mask              = (CY_WPS_TLV_VERSION | CY_WPS_TLV_MSG_TYPE | CY_WPS_TLV_ENROLLEE_NONCE | CY_WPS_TLV_REGISTRAR_NONCE | CY_WPS_TLV_UUID_R | CY_WPS_TLV_PUBLIC_KEY | CY_WPS_TLV_AUTH_TYPE_FLAGS | CY_WPS_TLV_ENCR_TYPE_FLAGS | CY_WPS_TLV_AUTHENTICATOR),
            .encrypted_tlv_mask    = 0,
            .packet_generator      = (cy_wps_packet_generator_t)cy_wps_write_nonce,
        },
        // Sending M3, Receiving M4
        [CY_WPS_SENDING_SECRET_HASHES] =
        {
            .valid_message_type    = WPS_ID_MESSAGE_M4,
            .outgoing_message_type = WPS_ID_MESSAGE_M3,
            .tlv_mask              = (CY_WPS_TLV_VERSION | CY_WPS_TLV_MSG_TYPE | CY_WPS_TLV_ENROLLEE_NONCE | CY_WPS_TLV_R_HASH1 | CY_WPS_TLV_R_HASH2 | CY_WPS_TLV_ENCRYPTION_SETTINGS | CY_WPS_TLV_AUTHENTICATOR),
            .encrypted_tlv_mask    = CY_WPS_TLV_R_SNONCE1,
            .packet_generator      = (cy_wps_packet_generator_t)cy_wps_write_hashes,
        },
        // Sending M5, Receiving M6
        [CY_WPS_SENDING_SECRET_NONCE1] =
        {
            .valid_message_type    = WPS_ID_MESSAGE_M6,
            .outgoing_message_type = WPS_ID_MESSAGE_M5,
            .tlv_mask              = (CY_WPS_TLV_VERSION | CY_WPS_TLV_MSG_TYPE | CY_WPS_TLV_ENROLLEE_NONCE | CY_WPS_TLV_ENCRYPTION_SETTINGS | CY_WPS_TLV_AUTHENTICATOR),
            .encrypted_tlv_mask    = CY_WPS_TLV_R_SNONCE2,
            .packet_generator      = (cy_wps_packet_generator_t)cy_wps_write_secret1,
        },
        // Sending M7, Receiving M8
        [CY_WPS_SENDING_SECRET_NONCE2] =
        {
            .valid_message_type    = WPS_ID_MESSAGE_M8,
            .outgoing_message_type = WPS_ID_MESSAGE_M7,
            .tlv_mask              = (CY_WPS_TLV_VERSION | CY_WPS_TLV_MSG_TYPE | CY_WPS_TLV_ENROLLEE_NONCE | CY_WPS_TLV_ENCRYPTION_SETTINGS | CY_WPS_TLV_AUTHENTICATOR),
            .encrypted_tlv_mask    = CY_WPS_TLV_CREDENTIAL | CY_WPS_TLV_SSID | CY_WPS_TLV_AUTH_TYPE | CY_WPS_TLV_ENCR_TYPE | CY_WPS_TLV_NW_KEY | CY_WPS_TLV_MAC_ADDR ,
            .packet_generator      = (cy_wps_packet_generator_t)cy_wps_write_secret2,
        },
    },

    [CY_WPS_REGISTRAR_AGENT] =
    {
        // Receiving M1, Sending M2
        [CY_WPS_SENDING_PUBLIC_KEYS] =
        {
            .valid_message_type    = WPS_ID_MESSAGE_M1,
            .outgoing_message_type = WPS_ID_MESSAGE_M2,
            .tlv_mask              = (CY_WPS_TLV_VERSION | CY_WPS_TLV_MSG_TYPE | CY_WPS_TLV_ENROLLEE_NONCE | CY_WPS_TLV_PUBLIC_KEY | CY_WPS_TLV_MAC_ADDR | CY_WPS_TLV_AUTH_TYPE_FLAGS | CY_WPS_TLV_ENCR_TYPE_FLAGS ),
            .encrypted_tlv_mask    = 0,
            .packet_generator      = (cy_wps_packet_generator_t)cy_wps_write_nonce,
        },
        // Receiving M3, Sending M4
        [CY_WPS_SENDING_SECRET_HASHES] =
        {
            .valid_message_type    = WPS_ID_MESSAGE_M3,
            .outgoing_message_type = WPS_ID_MESSAGE_M4,
            .tlv_mask              = (CY_WPS_TLV_VERSION | CY_WPS_TLV_MSG_TYPE | CY_WPS_TLV_REGISTRAR_NONCE | CY_WPS_TLV_E_HASH1 | CY_WPS_TLV_E_HASH2  | CY_WPS_TLV_AUTHENTICATOR),
            .encrypted_tlv_mask    = 0,
            .packet_generator      = (cy_wps_packet_generator_t)cy_wps_write_hashes,
        },
        // Receiving M5, Sending M6
        [CY_WPS_SENDING_SECRET_NONCE1] =
        {
            .valid_message_type    = WPS_ID_MESSAGE_M5,
            .outgoing_message_type = WPS_ID_MESSAGE_M6,
            .tlv_mask              = (CY_WPS_TLV_VERSION | CY_WPS_TLV_MSG_TYPE | CY_WPS_TLV_REGISTRAR_NONCE | CY_WPS_TLV_ENCRYPTION_SETTINGS | CY_WPS_TLV_AUTHENTICATOR),
            .encrypted_tlv_mask    = CY_WPS_TLV_E_SNONCE1,
            .packet_generator      = (cy_wps_packet_generator_t)cy_wps_write_secret2,
        },
        // Receiving M7, Sending M8
        [CY_WPS_SENDING_CREDENTIALS] =
        {
            .valid_message_type    = WPS_ID_MESSAGE_M7,
            .outgoing_message_type = WPS_ID_MESSAGE_M8,
            .tlv_mask              = (CY_WPS_TLV_VERSION | CY_WPS_TLV_MSG_TYPE | CY_WPS_TLV_REGISTRAR_NONCE | CY_WPS_TLV_ENCRYPTION_SETTINGS | CY_WPS_TLV_AUTHENTICATOR),
            .encrypted_tlv_mask    = CY_WPS_TLV_E_SNONCE2,
            .packet_generator      = (cy_wps_packet_generator_t)cy_wps_write_credentials,
        },
    },
};

/******************************************************
 *               Function Definitions
 ******************************************************/
/* Helper functions for WPS */
void cy_host_start_timer( void* workspace, uint32_t timeout )
{
    cy_host_workspace_t* host = (cy_host_workspace_t*) workspace;
    cy_rtos_get_time( &host->timer_reference );
    host->timer_timeout = timeout;
}

void cy_host_stop_timer( void* workspace )
{
    cy_host_workspace_t* host = (cy_host_workspace_t*) workspace;
    host->timer_timeout = 0;
}

