Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_WPS/cy_wps_common.c
uint32_t cy_host_get_current_time( void )
{
    cy_time_t time;
    cy_rtos_get_time(&time);
    return time;
}

uint32_t cy_host_get_timer( void* workspace )
{
    cy_host_workspace_t* host = (cy_host_workspace_t*)workspace;
    return host->timer_timeout;
}

#ifndef COMPONENT_4390X
static int trng_get_bytes(cyhal_trng_t *obj, uint8_t *output, size_t length, size_t *output_length)
{
    uint32_t offset = 0;
    /* If output is not word-aligned, write partial word */
    uint32_t prealign = (uint32_t)((uintptr_t)output % sizeof(uint32_t));
    if (prealign != 0) {
        uint32_t value = cyhal_trng_generate(obj);
        uint32_t count = sizeof(uint32_t) - prealign;
        memmove(&output[0], &value, count);
        offset += count;
    }
    /* Write aligned full words */
    for (; offset < length - (sizeof(uint32_t) - 1u); offset += sizeof(uint32_t)) {
        *(uint32_t *)(&output[offset]) = cyhal_trng_generate(obj);
    }
    /* Write partial trailing word if requested */
    if (offset < length) {
        uint32_t value = cyhal_trng_generate(obj);
        uint32_t count = length - offset;
        memmove(&output[offset], &value, count);
        offset += count;
    }
    *output_length = offset;
    return 0;
}
#endif
cy_rslt_t cy_host_random_bytes( void* buffer, size_t buffer_length, size_t* output_length )
{
#ifndef COMPONENT_4390X
    uint8_t* p = buffer;
    size_t length = 0;

    cyhal_trng_t obj;
    int ret;
    cy_rslt_t result;

    result = cyhal_trng_init(&obj);
    if( result != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to initialize hal TRNG \r\n");
        return result;
    }

    ret = trng_get_bytes(&obj, p, buffer_length, (size_t*) &length);
    if( ret != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to initialize random bytes \r\n");
        return result;
    }

    *output_length = length;
    cyhal_trng_free(&obj);
#else
    /* 43907 kits does not have TRNG module. Get the random
     * number from wifi-mw-core internal PRNG API. */
    cy_rslt_t result;
    result = cy_prng_get_random(buffer, buffer_length);
    if(result != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_prng_get_random failed \r\n");
        return result;
    }
    *output_length = buffer_length;
#endif
    return CY_RSLT_SUCCESS;
}

uint32_t cy_hton32(uint32_t intlong)
{
    return htobe32(intlong);
}

uint16_t cy_hton16(uint16_t intshort)
{
    return htobe16(intshort);
}

cy_rslt_t cy_wps_process_event(cy_wps_agent_t* workspace, cy_event_message_t* event)
{
    cy_rslt_t result;

    /* Check for an abort */
    if (event->event_type == CY_EVENT_ABORT_REQUESTED)
    {
        workspace->wps_result = CY_RSLT_WPS_ABORTED;
        return CY_RSLT_SUCCESS;
    }

    /* First try the agent specific event handler */
    result = workspace->event_handler(workspace, event);
    if (result == CY_RSLT_WPS_UNPROCESSED)
    {
        /* Pass it to the common event handler */
        result = cy_wps_common_event_handler(workspace, event);
    }
    else if (result == CY_RSLT_WPS_OTHER_ENROLLEE)
    {
        result = CY_RSLT_SUCCESS;
    }

    return result;
}

static cy_rslt_t cy_wps_common_event_handler(cy_wps_agent_t* workspace, cy_event_message_t* message)
{
    uint8_t            message_type = 0;
    uint8_t*           wps_packet_data;
    uint16_t           wps_packet_data_size;
    cy_packet_t        outgoing_packet;
    uint8_t*           iter;
    cy_rslt_t          result = CY_RSLT_SUCCESS;
    cy_wps_msg_packet_t*  packet_header;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Received WPS event type = [%d]\r\n", message->event_type);
    switch(message->event_type)
    {
        case CY_EVENT_EAPOL_PACKET_RECEIVED:
            if ( workspace->current_main_stage != CY_WPS_IN_WPS_HANDSHAKE )
            {
                /* We can ignore this packet */
                goto return_with_packet;
            }

            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Process Packet Fragmentation\r\n");
            result = cy_wps_process_packet_fragmentation(workspace, message->data.packet, &wps_packet_data, &wps_packet_data_size);
            if (result == CY_RSLT_WPS_IN_PROGRESS)
            {
                result = CY_RSLT_SUCCESS;
                goto return_with_packet;
            }
            else if (result != CY_RSLT_SUCCESS)
            {
                goto return_with_packet_and_maybe_fragment;
            }

            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Processing received packet\r\n");

            packet_header            = (cy_wps_msg_packet_t*)wps_packet_data;
            wps_packet_data          = cy_get_wps_packet_data( packet_header );
            if (wps_packet_data == NULL)
            {
                result = CY_RSLT_WPS_ERROR_INCORRECT_MESSAGE;
                goto return_with_packet_and_maybe_fragment;
            }
            wps_packet_data_size     = (uint16_t)(wps_packet_data_size - (wps_packet_data - (uint8_t*)packet_header));

            /* Check if it is a packet we care about */
            if ( packet_header->eap.type != CY_EAP_TYPE_WPS )
            {
                /* We can ignore this packet */
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Packet type is not WPS. Type = [%d]\r\n", packet_header->eap.type);
                goto return_with_packet_and_maybe_fragment;
            }

            if ( packet_header->eap.code == CY_EAP_CODE_FAILURE )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Received EAP Fail\r\n");
                result = CY_RSLT_WPS_ERROR_RECEIVED_EAP_FAIL;
                goto return_with_packet_and_maybe_fragment;
            }

            /* Some registrars send a second WSC start so we have to check the packet length or we may crash */
            if ( wps_packet_data_size == 0 )
            {
                /* We can ignore this packet */
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "WPS pkt size 0\r\n");
                goto return_with_packet_and_maybe_fragment;
            }

            /* Find the message type TLV */
            if ( tlv_read_value( WPS_ID_MSG_TYPE, wps_packet_data, wps_packet_data_size, &message_type, 1, TLV_UINT8 ) != TLV_SUCCESS )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Message type couldn't be found\r\n");
                result = CY_RSLT_WPS_ERROR_MESSAGE_MISSING_TLV;
                goto return_with_packet_and_maybe_fragment;
            }

            // Reverse registrar mode check
            if ( workspace->in_reverse_registrar_mode != 0 && message_type == WPS_ID_MESSAGE_M2D )
            {
                // Send NACK
                cy_wps_send_wsc_nack(workspace, 0);

                workspace->agent_type = CY_WPS_REGISTRAR_AGENT;



                result = CY_RSLT_WPS_ATTEMPTED_EXTERNAL_REGISTRAR_DISCOVERY;
                goto return_with_packet_and_maybe_fragment;
            }

            /* Check if we are a Registrar and this message is the reply for our last send packet. If so we can move to next sub-stage */
            if ( ( workspace->agent_type == CY_WPS_REGISTRAR_AGENT ) && ( message_type == wps_states[workspace->agent_type][workspace->current_sub_stage + 1].valid_message_type ) )
            {
                ++workspace->current_sub_stage;
            }

            /* Check if this message is valid for the current state */
            if ( message_type == wps_states[workspace->agent_type][workspace->current_sub_stage].valid_message_type )
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Received message %d\r\n", message_type);

                if ( workspace->agent_type == CY_WPS_ENROLLEE_AGENT )
                {
                    workspace->last_received_id = packet_header->eap.id;
                }

                result = cy_wps_process_message_content( workspace, wps_packet_data, wps_packet_data_size, wps_states[workspace->agent_type][workspace->current_sub_stage].tlv_mask );
                if ( result != CY_RSLT_SUCCESS )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "WPS: Processing message error\r\n");
                    if (result == CY_RSLT_WPS_ERROR_SECRET_NONCE_MISMATCH)
                    {
                        cy_wps_send_wsc_nack(workspace, 18);
                    }
                    else if (result == CY_RSLT_WPS_PBC_OVERLAP)
                    {
                        cy_wps_send_wsc_nack(workspace, 12); // XXX
                    }
                    else
                    {
                        if (result == CY_RSLT_WPS_ERROR_RECEIVED_WEP_CREDENTIALS)
                        {
                            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "WPS: Received wep credentials\r\n");
                            /* Terminate WPS */
                            workspace->wps_result = CY_RSLT_WPS_ERROR_RECEIVED_WEP_CREDENTIALS;
                        }
                        cy_wps_send_wsc_nack(workspace, 0); // XXX
                    }
                    goto return_with_packet_and_maybe_fragment;
                }

                if ( workspace->agent_type == CY_WPS_ENROLLEE_AGENT )
                {
                    /* Move to next stage as we've received the reply to our packet */
                    ++workspace->current_sub_stage;
                }
            }
            /* Check if we are an enrollee and we've received an M2D after sending M1 */
            else if (workspace->agent_type == CY_WPS_ENROLLEE_AGENT && workspace->current_sub_stage == CY_WPS_SENDING_PUBLIC_KEYS && message_type == WPS_ID_MESSAGE_M2D)
            {
                workspace->last_received_id = packet_header->eap.id;

