Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_WPS/cy_wps_common.c
        /* Start the HMAC calculation for next message */
        cy_sha2_hmac_starts  ( &workspace->hmac, (unsigned char*) &workspace->auth_key, SIZE_256_BITS, 0 );
        cy_sha2_hmac_update( &workspace->hmac, content, content_length );
    }

    /* If we have encrypted data, decrypt and process TLVs contained within */
    if ( encrypted_data != NULL )
    {
        result = cy_wps_process_encrypted_tlvs( workspace, encrypted_data, encrypted_data_length, wps_states[workspace->agent_type][workspace->current_sub_stage].encrypted_tlv_mask );
    }

    return result;
}

static cy_rslt_t cy_wps_process_encrypted_tlvs( cy_wps_agent_t* workspace, cy_wps_encryption_data_t* encrypted_data, uint16_t encrypted_data_length, uint32_t valid_tlv_mask )
{
    tlv16_data_t* tlv;
    cy_wps_hash_t hmac_output;
    uint32_t      parsed_tlvs = 0;
    cy_rslt_t     result = CY_RSLT_SUCCESS;
    int32_t       valid_credential_records = -1;
    int32_t       invalid_wep_records      = 0;
    uint8_t*      plain_text = encrypted_data->iv;
    int           plain_text_length;
    tlv16_data_t* key_wrap_auth = NULL;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Processing encrypted TLV\r\n");

    /* Decrypt the encrypted data */
    plain_text_length = cy_wps_decrypt_data( encrypted_data, encrypted_data_length, &workspace->key_wrap_key, plain_text );

    /* Find the key wrap auth element */
    if ( plain_text_length > 0 )
    {
        key_wrap_auth = tlv_find_tlv16(plain_text, (uint32_t) plain_text_length, WPS_ID_KEY_WRAP_AUTH);
    }

    if ( key_wrap_auth == NULL )
    {
        return CY_RSLT_WPS_ERROR_MESSAGE_MISSING_TLV;
    }

    /* Calculate the HMAC of the data (data only, not the last auth TLV) and compare it against the received HMAC */
    cy_sha2_hmac( (unsigned char *)&workspace->auth_key, SIZE_256_BITS, plain_text, (uint32_t) plain_text_length - sizeof(tlv16_header_t) - SIZE_64_BITS, (uint8_t*) &hmac_output, 0 );
    if ( memcmp( &hmac_output, key_wrap_auth->data, SIZE_64_BITS ) != 0 )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "WPS: HMAC error\r\n");
        return CY_RSLT_WPS_ERROR_ENCRYPTED_TLV_HMAC_FAIL;
    }

    /* Process all the remaining TLV elements */
    for ( tlv = (tlv16_data_t*) plain_text; ( (uint8_t*) tlv - plain_text ) < plain_text_length; tlv = (tlv16_data_t*) ( (uint8_t*) tlv + sizeof(tlv16_header_t) + cy_hton16( tlv->length ) ) )
    {
        tlv16_header_t  temp_tlv;
        tlv16_header_t* aligned_tlv = &temp_tlv;

        if (result != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "WPS: HMAC error\r\n");
            return result;
        }

        memcpy(aligned_tlv, tlv, sizeof(tlv16_header_t));

        switch ( cy_hton16( aligned_tlv->type ) )
        {
            case WPS_ID_R_SNONCE1:
                parsed_tlvs |= CY_WPS_TLV_R_SNONCE1;
                if ( (valid_tlv_mask & CY_WPS_TLV_R_SNONCE1) != 0 )
                {
                    /* Validate the secret nonce */
                    result = cy_wps_validate_secret_nonce(workspace, workspace->registrar_data, tlv->data, 0);
                }
                break;

            case WPS_ID_R_SNONCE2:
                parsed_tlvs |= CY_WPS_TLV_R_SNONCE2;
                if ( ( valid_tlv_mask & CY_WPS_TLV_R_SNONCE2 ) != 0 )
                {
                    /* Validate the secret nonce */
                    result = cy_wps_validate_secret_nonce(workspace, workspace->registrar_data, tlv->data, 1);
                }
                break;

            case WPS_ID_E_SNONCE1:
                parsed_tlvs |= CY_WPS_TLV_E_SNONCE1;
                if ( (valid_tlv_mask & CY_WPS_TLV_E_SNONCE1) != 0 )
                {
                    /* Validate the secret nonce */
                    result = cy_wps_validate_secret_nonce(workspace, workspace->enrollee_data, tlv->data, 0);
                }
                break;

            case WPS_ID_E_SNONCE2:
                parsed_tlvs |= CY_WPS_TLV_E_SNONCE2;
                if (( valid_tlv_mask & CY_WPS_TLV_E_SNONCE2) != 0 )
                {
                    /* Validate the secret nonce */
                    result = cy_wps_validate_secret_nonce(workspace, workspace->enrollee_data, tlv->data, 1);
                }
                break;

            case WPS_ID_CREDENTIAL:
                parsed_tlvs |= CY_WPS_TLV_CREDENTIAL;
                /* Note that we have seen a credential TLV */
                if ( valid_credential_records == -1 )
                {
                    valid_credential_records = 0;
                }
                result = cy_wps_process_credential( workspace, tlv->data, cy_hton16(aligned_tlv->length) );
                if ( result == CY_RSLT_SUCCESS )
                {
                    ++valid_credential_records;
                }
                else if ( result == CY_RSLT_WPS_ERROR_RECEIVED_WEP_CREDENTIALS )
                {
                    ++invalid_wep_records;
                    result = CY_RSLT_SUCCESS;
                }
                break;
        }
    }

    if ( result != CY_RSLT_SUCCESS )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "WPS: error processing encrypted TLVs\r\n");
        return result;
    }

    /* Check if we received a credentials TLV */
    if ( result == CY_RSLT_SUCCESS && valid_credential_records != -1 )
    {
        cy_host_start_timer( workspace->wps_host_workspace, 500 );

        /* Handshake is finished so allow the enrollee the deal with the timeout */
        workspace->current_main_stage = CY_WPS_CLOSING_EAP;
        workspace->current_sub_stage  = 0;

        /* Check if any were valid */
        if ( valid_credential_records > 0 )
        {
            // Send back Done
            cy_wps_send_done( workspace );
        }
        else /* Otherwise we received invalid credentials (e.g. WEP security) */
        {
            if ( invalid_wep_records != 0 )
            {
                result = CY_RSLT_WPS_ERROR_RECEIVED_WEP_CREDENTIALS;
            }
            else
            {
                result = CY_RSLT_WPS_ERROR_RECEIVED_INVALID_CREDENTIALS;
            }
            /* Send back NACK, but let the state machine continue to the end */
            cy_wps_send_wsc_nack(workspace, 0);
        }
    }

    return result;
}

static cy_rslt_t cy_wps_process_credential( cy_wps_agent_t* workspace, uint8_t* data, uint16_t data_length )
{
    cy_wps_internal_credential_t credential;
    tlv16_data_t*    tlv     = (tlv16_data_t*) data;
    uint8_t*         tlv_end = data + data_length;
#if 1
    tlv16_header_t  temp_tlv;
    tlv16_header_t* aligned_tlv = &temp_tlv;
#else
#define aligned_tlv      tlv
#endif

    memset(&credential, 0, sizeof(credential));

    for ( ; (uint8_t*) tlv < tlv_end; tlv = (tlv16_data_t*) ( tlv->data + cy_hton16( aligned_tlv->length ) ) )
    {

        memcpy(aligned_tlv, tlv, sizeof(tlv16_header_t));

