Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_WPS/cy_wps_common.c
        switch ( cy_hton16( aligned_tlv->type ) )
        {
            case WPS_ID_SSID:
                credential.ssid_length = (uint8_t) cy_hton16( aligned_tlv->length );
                memcpy( credential.ssid, tlv->data, credential.ssid_length );
                break;

            case WPS_ID_AUTH_TYPE:
                credential.authentication_type = CY_WPS_HOST_READ_16_BE(tlv->data);
                break;

            case WPS_ID_ENCR_TYPE:
                credential.encryption_type = CY_WPS_HOST_READ_16_BE(tlv->data);
                break;

            case WPS_ID_NW_KEY:
                credential.network_key_length = (uint8_t) cy_hton16( aligned_tlv->length );
                memcpy( credential.network_key, tlv->data, credential.network_key_length );
                break;

            case WPS_ID_KEY_WRAP_AUTH:
                break;

            case WPS_ID_MAC_ADDR:
                if ( workspace->my_data.supported_version >= WPS_VERSION2 && workspace->their_data.supported_version >= WPS_VERSION2 )
                {
                    if ( memcmp( tlv->data, &workspace->my_data.mac_address, sizeof(whd_mac_t) ) != 0 )
                    {
                        /* MAC Address verification failed */

                    }
                }
                break;
        }
    }

    if ( credential.encryption_type != CY_WPS_NO_UNDEFINED && credential.encryption_type != CY_WPS_WEP_ENCRYPTION )
    {
        cy_wps_host_store_credential( workspace->wps_host_workspace, &credential );
        return CY_RSLT_SUCCESS;
    }
    else
    {
        return CY_RSLT_WPS_ERROR_RECEIVED_WEP_CREDENTIALS;
    }
}


/*
 * Note: It is assumed that output = wps_hash_t[n] where sizeof(output) >= output_length;
 */
static cy_rslt_t cy_wps_calculate_kdf(uint8_t* key, uint16_t key_length, char* personalization_string, uint8_t* output, uint16_t output_length)
{
    uint32_t i;
    uint32_t iterations;
    uint32_t temp;
    uint16_t string_length;
    uint8_t input[4 + MAX_PERSONALIZATION_STRING_SIZE + 4];
    cy_wps_hash_t* hmac_output = (cy_wps_hash_t*) output;

    iterations = output_length / PRF_DIGEST_SIZE;

    /* Prepare the input buffer. During the iterations, we need only replace the value of i at the start of the buffer. */
    string_length = (uint16_t) strlen( personalization_string );
    cy_wps_assert("WPS: personalization_string too long\r\n", string_length <= MAX_PERSONALIZATION_STRING_SIZE);
    memcpy( &input[4], personalization_string, string_length );
    temp = cy_hton32( (uint32_t)( output_length * 8 ) );
    memcpy( &input[4 + string_length], &temp, 4 );

    for ( i = 0; i < iterations; i++ )
    {
        /* Set the current value of i at the start of the input buffer */
        temp = cy_hton32( i + 1 ); /* i should start at 1 */
        memcpy( &input[0], &temp, 4 );
        cy_sha2_hmac( key, key_length, input, (uint32_t)( 4 + string_length + 4 ), (uint8_t*) &hmac_output[i], 0 );
    }

    return CY_RSLT_SUCCESS;
}


static void cy_wps_encrypt_data(uint8_t* input, uint16_t input_length, cy_key_wrap_key_t* encr_key, uint8_t* output, cy_wps_iv_t* iv)
{
    size_t output_length;

    /* Generate a random iv */
    cy_host_random_bytes( iv->octet, SIZE_128_BITS, &output_length );

    cy_aes_cbc_encrypt( input, input_length, output, encr_key->octet, (SIZE_128_BITS * 8), iv->octet );
}

/* Note: plain_text can point to the encryption_data->data */
static int cy_wps_decrypt_data(cy_wps_encryption_data_t* encrypted_data, uint16_t encrypted_data_length, cy_key_wrap_key_t* encr_key, uint8_t* plain_text)
{
    uint32_t output_length;
    cy_aes_cbc_decrypt( encrypted_data->data, encrypted_data_length, plain_text, &output_length, encr_key->octet, (SIZE_128_BITS * 8), encrypted_data->iv );

    return output_length;
}


/*
 * Function to create M1 and M2
 */
uint8_t* cy_wps_write_nonce(cy_wps_agent_t* workspace, uint8_t* iter)
{
    uint16_t config_error       = 0;
    if ( workspace->agent_type == CY_WPS_REGISTRAR_AGENT )
    {
        iter = tlv_write_value( iter, agent_specific_tlv_id[OPPOSITE_AGENT_TYPE(workspace->agent_type)][CY_WPS_NONCE_INDEX], SIZE_128_BITS, &workspace->their_data.nonce, TLV_UINT8_PTR );
        iter = tlv_write_value( iter, agent_specific_tlv_id[workspace->agent_type][CY_WPS_NONCE_INDEX], sizeof(cy_wps_nonce_t), &workspace->my_data.nonce, TLV_UINT8_PTR );
        iter = tlv_write_value( iter, agent_specific_tlv_id[workspace->agent_type][CY_WPS_UUID_INDEX],  WPS_ID_UUID_S,       &workspace->uuid,          TLV_UINT8_PTR );
    }
    if ( workspace->agent_type == CY_WPS_ENROLLEE_AGENT )
    {
        iter = tlv_write_value( iter, agent_specific_tlv_id[workspace->agent_type][CY_WPS_UUID_INDEX],  WPS_ID_UUID_S,       &workspace->uuid,          TLV_UINT8_PTR );
        iter = tlv_write_value( iter, WPS_ID_MAC_ADDR,        WPS_ID_MAC_ADDR_S,        &workspace->my_data.mac_address, TLV_UINT8_PTR );
        iter = tlv_write_value( iter, agent_specific_tlv_id[workspace->agent_type][CY_WPS_NONCE_INDEX], sizeof(cy_wps_nonce_t), &workspace->my_data.nonce, TLV_UINT8_PTR );
    }
    iter = tlv_write_value( iter, WPS_ID_PUBLIC_KEY,      sizeof(cy_public_key_t),     &workspace->my_data.public_key, TLV_UINT8_PTR );
    iter = tlv_write_value( iter, WPS_ID_AUTH_TYPE_FLAGS, WPS_ID_AUTH_TYPE_FLAGS_S, &workspace->my_data.authTypeFlags,      TLV_UINT16 );
    iter = tlv_write_value( iter, WPS_ID_ENCR_TYPE_FLAGS, WPS_ID_ENCR_TYPE_FLAGS_S, &workspace->my_data.encrTypeFlags,      TLV_UINT16 );
    iter = tlv_write_value( iter, WPS_ID_CONN_TYPE_FLAGS, WPS_ID_CONN_TYPE_FLAGS_S, &workspace->connTypeFlags,      TLV_UINT8 );
    iter = tlv_write_value( iter, WPS_ID_CONFIG_METHODS,  WPS_ID_CONFIG_METHODS_S,  &workspace->device_details->config_methods,  TLV_UINT16 );
    if ( workspace->agent_type == CY_WPS_ENROLLEE_AGENT )
    {
        iter = tlv_write_value( iter, WPS_ID_SC_STATE,        WPS_ID_SC_STATE_S,        &workspace->scState,             TLV_UINT8 );
    }
    iter = tlv_write_value( iter, WPS_ID_MANUFACTURER,    (uint16_t) strlen( workspace->device_details->manufacturer ), workspace->device_details->manufacturer,  TLV_UINT8_PTR );
    iter = tlv_write_value( iter, WPS_ID_MODEL_NAME,      (uint16_t) strlen( workspace->device_details->model_name   ), workspace->device_details->model_name,    TLV_UINT8_PTR );
    iter = tlv_write_value( iter, WPS_ID_MODEL_NUMBER,    (uint16_t) strlen( workspace->device_details->model_number ), workspace->device_details->model_number,  TLV_UINT8_PTR );
    iter = tlv_write_value( iter, WPS_ID_SERIAL_NUM,      (uint16_t) strlen( workspace->device_details->serial_number), workspace->device_details->serial_number, TLV_UINT8_PTR );
    iter = tlv_write_value( iter, WPS_ID_PRIM_DEV_TYPE,   WPS_ID_PRIM_DEV_TYPE_S,                                       &workspace->primary_device,               TLV_UINT8_PTR );
    iter = tlv_write_value( iter, WPS_ID_DEVICE_NAME,     (uint16_t) strlen( workspace->device_details->device_name ),  workspace->device_details->device_name,   TLV_UINT8_PTR );
    iter = tlv_write_value( iter, WPS_ID_RF_BAND,         WPS_ID_RF_BAND_S,                                             &workspace->rfBand,                       TLV_UINT8     );
    iter = tlv_write_value( iter, WPS_ID_ASSOC_STATE,     WPS_ID_ASSOC_STATE_S,                                         &workspace->association_state,            TLV_UINT16    );
    if ( workspace->agent_type == CY_WPS_ENROLLEE_AGENT )
    {
        iter = tlv_write_value( iter, WPS_ID_DEVICE_PWD_ID,   WPS_ID_DEVICE_PWD_ID_S,  &workspace->device_password_id, TLV_UINT16 );
        iter = tlv_write_value( iter, WPS_ID_CONFIG_ERROR,    WPS_ID_CONFIG_ERROR_S,   &config_error,                  TLV_UINT16 );
    }
    if ( workspace->agent_type == CY_WPS_REGISTRAR_AGENT )
    {
        iter = tlv_write_value( iter, WPS_ID_CONFIG_ERROR,    WPS_ID_CONFIG_ERROR_S,   &config_error,                  TLV_UINT16 );
        iter = tlv_write_value( iter, WPS_ID_DEVICE_PWD_ID,   WPS_ID_DEVICE_PWD_ID_S,  &workspace->device_password_id, TLV_UINT16 );
    }
    iter = tlv_write_value( iter, WPS_ID_OS_VERSION,      WPS_ID_OS_VERSION_S,     &workspace->device_details->os_version, TLV_UINT32 );

    /* WSC 2.0, add WFA vendor id and subelements to vendor extension attribute  */
    if ( workspace->my_data.supported_version >= WPS_VERSION2 )
    {
        /* Add reqToEnroll subelement to vendorExt_bufObj */
        if ( workspace->agent_type == CY_WPS_ENROLLEE_AGENT )
        {
            cy_wps_m1_vendor_ext_t vendor_ext;

