Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_WPS/cy_wps_common.c
            memcpy( vendor_ext.vendor_id, WFA_VENDOR_EXT_ID, 3 );
            vendor_ext.subid_version2.type      = WPS_WFA_SUBID_VERSION2;
            vendor_ext.subid_version2.length    = 1;
            vendor_ext.subid_version2.data      = workspace->my_data.supported_version;
            vendor_ext.request_to_enroll.type   = WPS_WFA_SUBID_REQ_TO_ENROLL;
            vendor_ext.request_to_enroll.length = 1;
            vendor_ext.request_to_enroll.data   = 1;
            iter = tlv_write_value( iter, WPS_ID_VENDOR_EXT, sizeof(cy_wps_m1_vendor_ext_t), &vendor_ext, TLV_UINT8_PTR );
        }
        else
        {
            iter = cy_wps_write_vendor_extension( iter, workspace );
        }
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Sending nonce\r\n");
    return iter;
}

/*
 * Function to create M3 and M4
 */
uint8_t* cy_wps_write_hashes(cy_wps_agent_t* workspace, uint8_t* iter)
{
    // Write my hash1 and hash2
    iter = tlv_write_value( iter, agent_specific_tlv_id[workspace->agent_type][CY_WPS_HASH1_INDEX], sizeof(cy_wps_hash_t), &workspace->my_data.secret_hash[0], TLV_UINT8_PTR );
    iter = tlv_write_value( iter, agent_specific_tlv_id[workspace->agent_type][CY_WPS_HASH2_INDEX], sizeof(cy_wps_hash_t), &workspace->my_data.secret_hash[1], TLV_UINT8_PTR );

    // If I am a registrar then I need to send my encrypted secret nonce 1 too
    if ( workspace->agent_type == CY_WPS_REGISTRAR_AGENT )
    {
        iter = cy_wps_write_secret1( workspace, iter );
    }
    else
    /* WSC 2.0, add WFA vendor id and sub-elements to vendor extension attribute  */
    if ( workspace->my_data.supported_version >= WPS_VERSION2 )
    {
        iter = cy_wps_write_vendor_extension( iter, workspace );
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Sending hashes\r\n");
    return iter;
}

/*
 * Function to create M5 and M6
 */
uint8_t* cy_wps_write_secret1(cy_wps_agent_t* workspace, uint8_t* iter)
{
    uint8_t* temp_iter;

    // Write my secret 1
    temp_iter = cy_wps_start_encrypted_tlv(iter);
    temp_iter = tlv_write_value( temp_iter, agent_specific_tlv_id[workspace->agent_type][CY_WPS_SNONCE1_INDEX], sizeof(cy_wps_nonce_t), &workspace->my_data.secret_nonce[0], TLV_UINT8_PTR );
    iter      = cy_wps_end_encrypted_tlv(workspace, iter, temp_iter );

    /* WSC 2.0, add WFA vendor id and sub-elements to vendor extension attribute  */
    if ( workspace->my_data.supported_version >= WPS_VERSION2 )
    {
        iter = cy_wps_write_vendor_extension( iter, workspace );
    }

    return iter;
}

/*
 * Function to create M7
 */
uint8_t* cy_wps_write_secret2(cy_wps_agent_t* workspace, uint8_t* iter)
{
    uint8_t* temp_iter;

    // Write my secret 2
    temp_iter = cy_wps_start_encrypted_tlv(iter);
    temp_iter = tlv_write_value( temp_iter, agent_specific_tlv_id[workspace->agent_type][CY_WPS_SNONCE2_INDEX], sizeof(cy_wps_nonce_t), &workspace->my_data.secret_nonce[1], TLV_UINT8_PTR );
    iter      = cy_wps_end_encrypted_tlv(workspace, iter, temp_iter );

    /* WSC 2.0, add WFA vendor id and sub-elements to vendor extension attribute  */
    if ( workspace->my_data.supported_version >= WPS_VERSION2 )
    {
        iter = cy_wps_write_vendor_extension( iter, workspace );
    }

    return iter;
}

/*
 * Function to create M8
 */
static uint8_t* cy_wps_write_credentials(cy_wps_agent_t* workspace, uint8_t* iter)
{
    uint8_t* encrypt_iter;
    uint8_t* credential_iter;
    uint16_t network_index = 1;
    cy_wps_internal_credential_t credential;
    uint16_t authentication_type;
    uint16_t encryption_type;
    tlv16_data_t* credential_header;
    memset(&credential, 0, sizeof(cy_wps_internal_credential_t));
    cy_wps_host_retrieve_credential(workspace->wps_host_workspace, &credential);

    // Not all WPS v1.0 enrollees understand mixed modes of authentication or encryption so minimize the choice
    if ( workspace->their_data.supported_version < WPS_VERSION2 )
    {
        authentication_type = cy_hton16( credential.authentication_type & workspace->their_data.authTypeFlags );
        encryption_type     = cy_hton16( credential.encryption_type & workspace->their_data.encrTypeFlags );
        if ( encryption_type & (uint16_t)cy_hton16(CY_WPS_AES_ENCRYPTION ) )
        {
            encryption_type = (uint16_t)cy_hton16(CY_WPS_AES_ENCRYPTION);
        }
    }
    else
    {
        authentication_type = cy_hton16( credential.authentication_type );
        encryption_type     = cy_hton16( credential.encryption_type  );
    }

    /* Write credentials */
    encrypt_iter    = cy_wps_start_encrypted_tlv( iter );
    credential_iter = tlv_write_header( encrypt_iter, WPS_ID_CREDENTIAL,  0 );
    credential_iter = tlv_write_value( credential_iter, WPS_ID_NW_INDEX,  1,                              &network_index,                  TLV_UINT8 );
    credential_iter = tlv_write_value( credential_iter, WPS_ID_SSID,      credential.ssid_length,         credential.ssid,                 TLV_UINT8_PTR );
    credential_iter = tlv_write_value( credential_iter, WPS_ID_AUTH_TYPE, WPS_ID_AUTH_TYPE_S,             &authentication_type,            TLV_UINT8_PTR );
    credential_iter = tlv_write_value( credential_iter, WPS_ID_ENCR_TYPE, WPS_ID_ENCR_TYPE_S,             &encryption_type,                TLV_UINT8_PTR );
    credential_iter = tlv_write_value( credential_iter, WPS_ID_NW_KEY,    credential.network_key_length,  credential.network_key,          TLV_UINT8_PTR );
    credential_iter = tlv_write_value( credential_iter, WPS_ID_MAC_ADDR,  sizeof(whd_mac_t),             &workspace->their_data.mac_address, TLV_UINT8_PTR );

    /* Finish off the credential TLV */
    credential_header = (tlv16_data_t*)encrypt_iter;
    credential_header->length       = cy_hton16( (uint16_t)( credential_iter - credential_header->data ) );

    /* Finish off the encrypted TLV */
    iter = cy_wps_end_encrypted_tlv( workspace, iter, credential_iter );

    /* WSC 2.0, add WFA vendor id and sub-elements to vendor extension attribute  */
    if ( workspace->my_data.supported_version >= WPS_VERSION2 )
    {
        iter = cy_wps_write_vendor_extension( iter, workspace );
    }

    if ( workspace->wps_mode == CY_WPS_PBC_MODE )
    {
        cy_wps_clear_pbc_overlap_array( );
        cy_wps_record_last_pbc_enrollee( &workspace->their_data.mac_address );
    }

