Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/COMPONENT_WPS/cy_wps_common.c
    /* Give 500ms for enrollee to send WSC Done before we decide it's all over */
    cy_host_start_timer( workspace->wps_host_workspace, 500 );
    workspace->current_main_stage = CY_WPS_CLOSING_EAP;

    return iter;
}

static uint8_t* cy_wps_start_encrypted_tlv(uint8_t* iter)
{
    return (iter + sizeof(tlv16_header_t) + sizeof(cy_wps_iv_t));
}

/*
 * Note: start_of_encrypted_tlv_header should be the value provided to wps_start_encrypted_tlv()
 *       data_length should be the the number of bytes from start_of_encrypted_tlv_header to the end of the content to be encrypted
 */
static uint8_t* cy_wps_end_encrypted_tlv( cy_wps_agent_t* workspace, uint8_t* start_of_encrypted_tlv_header, uint8_t* end_of_data )
{
    cy_wps_hash_t hmac_output;
    tlv16_header_t* header   = (tlv16_header_t*)start_of_encrypted_tlv_header;
    uint8_t*   start_of_data = start_of_encrypted_tlv_header + sizeof(tlv16_header_t) + sizeof(cy_wps_iv_t);
    uint16_t   data_length   = (uint16_t)(end_of_data - start_of_data);
    uint16_t encrypted_size;

    /* Hash existing content */
    cy_sha2_hmac( (unsigned char *)&workspace->auth_key, SIZE_256_BITS, start_of_data, data_length, (uint8_t*) &hmac_output, 0 );

    /* Append a key wrap auth TLV */
    end_of_data = tlv_write_value( end_of_data, WPS_ID_KEY_WRAP_AUTH, SIZE_64_BITS, &hmac_output, TLV_UINT8_PTR );
    data_length = (uint16_t)(end_of_data - start_of_data);

    /* Encrypt the entire block and put the IV at the right spot */
    encrypted_size = (uint16_t) WPS_PADDED_AES_ROUND_UP(data_length, AES_BLOCK_SZ);
    cy_wps_encrypt_data( start_of_data, data_length, &workspace->key_wrap_key, start_of_data, (cy_wps_iv_t*)(start_of_encrypted_tlv_header + sizeof(tlv16_header_t)) );

    /* Fill in the TLV header reserved at the start by wps_start_encrypted_tlv() */
    header->type   = cy_hton16(WPS_ID_ENCR_SETTINGS);
    header->length = cy_hton16( (uint16_t)( encrypted_size + sizeof(cy_wps_iv_t) ) );

    return start_of_data + encrypted_size;
}


void cy_wps_deinit_workspace( cy_wps_agent_t* workspace )
{
    uint8_t a;
    for ( a = 0; a < 3; ++a )
    {
        if ( workspace->ie.common[a].data != NULL )
        {
            cy_wps_host_remove_vendor_ie( (uint32_t) workspace->interface, workspace->ie.common[a].data, workspace->ie.common[a].length, workspace->ie.common[a].packet_mask );
            cy_wps_free( workspace->ie.common[a].data );
            workspace->ie.common[a].data = NULL;
        }
    }

    cy_wps_cleanup_workspace( workspace );
}

static void cy_wps_cleanup_workspace( cy_wps_agent_t* workspace )
{
    if ( workspace->m1_copy != NULL )
    {
        cy_wps_free(workspace->m1_copy);
        workspace->m1_copy = NULL;
    }

    cy_wps_free_unfragmented_packet( workspace );
}

static void cy_wps_init_unfragmented_packet( cy_wps_agent_t* workspace, uint16_t total_length )
{
    WPS_ASSERT(workspace->fragmented_packet == NULL);

    workspace->fragmented_packet_length = 0;
    if ( total_length != 0 )
    {
        workspace->fragmented_packet_length_max = total_length;
    }
    else
    {
        workspace->fragmented_packet_length_max = 1024;
    }
    workspace->fragmented_packet = (uint8_t*) cy_wps_malloc("wps fragd pkt", workspace->fragmented_packet_length_max);
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Allocated fragmented packet = [0x%X]. Len Max = [%d]\r\n", (unsigned int*) workspace->fragmented_packet, workspace->fragmented_packet_length_max);
}

static void cy_wps_append_fragment( cy_wps_agent_t* workspace, void* fragment, uint16_t fragment_length )
{
    WPS_ASSERT(workspace->fragmented_packet != NULL);

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Frag Pkt Len + Frag Len = [%d], Max Frag Len = [%d]\r\n", workspace->fragmented_packet_length + fragment_length, workspace->fragmented_packet_length_max);
    if ( workspace->fragmented_packet_length + fragment_length >= workspace->fragmented_packet_length_max )
    {
        void* new_packet = cy_wps_malloc("wps append frag", (uint32_t)( workspace->fragmented_packet_length_max + fragment_length + 1024 ) );
        WPS_ASSERT(new_packet != NULL);
        workspace->fragmented_packet_length_max = (uint16_t)( workspace->fragmented_packet_length_max + fragment_length + 1024 );
        memcpy( new_packet, workspace->fragmented_packet, workspace->fragmented_packet_length );
        cy_wps_free( workspace->fragmented_packet );
        workspace->fragmented_packet = (uint8_t*) new_packet;
    }

    memcpy( &workspace->fragmented_packet[workspace->fragmented_packet_length], fragment, fragment_length );
    workspace->fragmented_packet_length = (uint16_t) ( workspace->fragmented_packet_length + fragment_length );
}

static void cy_wps_retrieve_unfragmented_packet( cy_wps_agent_t* workspace, cy_packet_t* packet, uint16_t* packet_length )
{
    *packet        = workspace->fragmented_packet;
    *packet_length = workspace->fragmented_packet_length;
}

static void cy_wps_free_unfragmented_packet( cy_wps_agent_t* workspace )
{
    if ( workspace->fragmented_packet != NULL )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Freeing defragmented packet. Len Max = [%d]\r\n", workspace->fragmented_packet_length_max);
        cy_wps_free( workspace->fragmented_packet );
        workspace->fragmented_packet = NULL;
        workspace->fragmented_packet_length = 0;
        workspace->processing_fragmented_packet = FALSE;
    }
}

static cy_rslt_t cy_wps_process_packet_fragmentation(cy_wps_agent_t* workspace, cy_packet_t eapol_packet, uint8_t** data, uint16_t* data_size )
{
    uint8_t*          packet_data              = whd_buffer_get_current_piece_data_pointer( workspace->interface->whd_driver, eapol_packet );
    uint16_t          real_packet_length       = whd_buffer_get_current_piece_size( workspace->interface->whd_driver, eapol_packet );        /* Packet length includes Ethernet header */
    cy_wps_msg_packet_t* packet                   = (cy_wps_msg_packet_t*) packet_data;
    uint16_t          data_length              = (uint16_t)( real_packet_length - sizeof(cy_wps_msg_packet_header_t) );
    uint16_t          eap_packet_length;
    uint16_t          calculated_packet_length;
    eap_packet_length = packet->eapol.length;
    eap_packet_length = CY_WPS_HOST_READ_16_BE((uint8_t *)&eap_packet_length);
    calculated_packet_length = sizeof( cy_ether_header_t ) + sizeof( cy_eapol_header_t ) + eap_packet_length;

    /* Sanity check various lengths */
    if ( real_packet_length < calculated_packet_length )
    {
        /* This is a runt packet. The only thing we can do is flag an error. */
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Runt WPS packet. Real packet length: %u Calculated packet length: %u\r\n", (unsigned int)real_packet_length, (unsigned int)calculated_packet_length );
        return CY_RSLT_WPS_ERROR_RUNT_WPS_PACKET;
    }
    else if ( real_packet_length > calculated_packet_length )
    {
        /* This is a giant packet. Recalculate data length to remove trailing garbage */
        data_length = eap_packet_length - ( sizeof( cy_eap_header_t ) + sizeof( cy_eap_expanded_header_t ) );
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "WPS packet with trailing garbage. Recalculated data length is: %u\r\n", (unsigned int)data_length );
    }

